#include <iostream>
using namespace std;
int main()
{
    int a[20]; // объявляем статический массив,
    // задав максимальную размерность
    int n;
    cout << "n = ";
    cin >> n; // ввели количество элементов массива
    for (int i = 0; i < n; ++i) // ввод и обработка данных
    {
    cout << "a[" << i << "] = ";
    cin >> a[i]; // ввод очередного элемента
    if (a[i] < 0) // если i-й элемент массива отрицательный,
    a[i] = 0; // заменяем его нулем
    }
    for (int i = 0; i < n; ++i) // вывод массива на экран
    cout << a[i] << "\t";
    return 0;
}