int **b = new int *[4]; // объявили двумерный динамический массив
for (int i = 0; i < 2; ++i) b[i] = new int [5];
for (int i = 0; i < 4; ++i) // ввод элементов массива
{
    cout << "b[" << i << "][" << j << "] = ";
    cin >> *(*(b+i)+j); // введенное значение записываем в b[i][j]
}
...
for (int i = 0; i < 4; ++i, cout << endl) // вывод элементов массива
for (int j = 0; j < 5; ++j)
{
    // выводим на экран значение b[i][j]
    cout << "b[" << i << "][" << j << "] = " << *(*(b+i)+j) << "\t";